<a href="https://colab.research.google.com/github/Freya-LR/Leetcode/blob/main/181.Employees%20Earning%20More%20Than%20Their%20Managers.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Write an SQL query to find the employees who earn more than their managers.
Input: 
Employee table:

| id | name  | salary | managerId |

| 1  | Joe   | 70000  | 3         |

| 2  | Henry | 80000  | 4         |

| 3  | Sam   | 60000  | Null      |

| 4  | Max   | 90000  | Null      |

Output: 

| Employee |

| Joe      |

Explanation: Joe is the only employee who earns more than his manager.

In [ ]:
/* Write your T-SQL query statement below */
SELECT e1.name as Employee 
from Employee e1 
 join Employee e2 
on e2.id=e1.managerId
where e1.salary > e2.salary

In [ ]:
# Write your MySQL query statement below
select e1.name as Employee from Employee e1, Employee e2
where e1.managerId =e2.id
and e1.salary >e2.salary